Branche technique/Labs/lab-laravel-basic/app/Http/Controllers/TaskController.php

select * from `tasks`
---
    public function index()
    {
        // Retrieve all tasks from the database
        $tasks = Task::all();

insert into `tasks` (`name`, `description`, `updated_at`, `created_at`) values ('Amal Tyler', '<p>ify &nbsp;&nbsp;<strong>fyufufyfuyfyufu</strong></p>\r\n<p>&nbsp;</p>', '2023-11-17 08:32:19', '2023-11-17 08:32:19')
---
    public function store(FormTaskRequest $request, Task $task)
    {

     // 1. Validation
     $validatedData = $request->validated();

     // 2. Create the Task
     $task->create($validatedData);